In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline

import seaborn as sns

from sklearn.preprocessing import StandardScaler
ss = StandardScaler()

from sklearn.linear_model import LinearRegression
lrmdl = LinearRegression()

from sklearn.preprocessing import PolynomialFeatures

In [2]:
pd.options.display.float_format = '{:,.4f}'.format
sns.set_style(style='darkgrid')

In [3]:
df = pd.read_csv('TMDB-train.csv')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 23 columns):
id                       3000 non-null int64
belongs_to_collection    604 non-null object
budget                   3000 non-null int64
genres                   2993 non-null object
homepage                 946 non-null object
imdb_id                  3000 non-null object
original_language        3000 non-null object
original_title           3000 non-null object
overview                 2992 non-null object
popularity               3000 non-null float64
poster_path              2999 non-null object
production_companies     2844 non-null object
production_countries     2945 non-null object
release_date             3000 non-null object
runtime                  2998 non-null float64
spoken_languages         2980 non-null object
status                   3000 non-null object
tagline                  2403 non-null object
title                    3000 non-null object
Keywords                 2724 non-null object
cast                     2987 non-null object
crew                     2984 non-null object
revenue                  3000 non-null int64
dtypes: float64(2), int64(3), object(18)
memory usage: 539.1+ KB

In [49]:
df1 = pd.DataFrame([{'id': 313576, 'name': 'Hot Tub Time Machine Collection', 'poster_path': '/iEhb00TGPucF0b4joM1ieyY026U.jpg', 'backdrop_path': '/noeTVcgpBiD48fDjFVic1Vz7ope.jpg'}])

In [50]:
df1

,backdrop_path,id,name,poster_path
0,/noeTVcgpBiD48fDjFVic1Vz7ope.jpg,313576,Hot Tub Time Machine Collection,/iEhb00TGPucF0b4joM1ieyY026U.jpg

In [51]:
df2 = pd.DataFrame([{'id': 28, 'name': 'Action'}, {'id': 35, 'name': 'Comedy'}, {'id': 10402, 'name': 'Music'}, {'id': 10751, 'name': 'Family'}, {'id': 12, 'name': 'Adventure'}])
df2

      id       name
0     28     Action
1     35     Comedy
2  10402      Music
3  10751     Family
4     12  Adventure

In [52]:
d = np.array(df2.transpose().loc['id'])
d

array([28, 35, 10402, 10751, 12], dtype=object)

In [53]:
df3 = pd.DataFrame(np.ones((1,d.size),dtype=np.int8),columns=d)
df3

   28     35     10402  10751  12
0      1      1      1      1      1

In [54]:
df1 = pd.concat([df1,df3],axis=1)
df1

,backdrop_path,id,name,poster_path,28,35,10402,10751,12
0,/noeTVcgpBiD48fDjFVic1Vz7ope.jpg,313576,Hot Tub Time Machine Collection,/iEhb00TGPucF0b4joM1ieyY026U.jpg,1,1,1,1,1